# When should I use the "inplace" parameter in pandas?

üêº Tuto on pandas by Data School - Exercice performed by Dorian.H Mekni ü•á | Thu 10 Dec 2020

In [16]:
import pandas as pd

In [17]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [18]:
ufo.shape

(18241, 5)

In [19]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [20]:
ufo.drop('City', axis=1).head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00


‚òùüèª The city column is now gone. Let's read now our dataframe through the head() method.

In [21]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00


üòí When reading our dataframe, the city column hasn't disappeared. 

‚ùóÔ∏èThe reason why, the drop method did not processed a definite change is because the parameter inplace is set to False by default. 

üßê In order to crystallize our change, we need to set the parameter inplace to True :

In [22]:
ufo.drop('City', axis=1, inplace=True)

In [23]:
ufo.head()

  Colors Reported Shape Reported State             Time
0             NaN       TRIANGLE    NY   6/1/1930 22:00
1             NaN          OTHER    NJ  6/30/1930 20:00
2             NaN           OVAL    CO  2/15/1931 14:00
3             NaN           DISK    KS   6/1/1931 13:00
4             NaN          LIGHT    NY  4/18/1933 19:00


‚úÖ The change took place as the inplace parameter was set to the appropriate value.


üßê 

    Inplace=false allows the analyst to experiment without altering the existing dataframe. 
    
    Inplace=True allows a modification to stay and therefore a dataframe to change.

# üé© Bonus tips : iPython | Jupyter Notebook ONLY


ü§†  Parameters
----------
Let's enjoy here the benefit of inplace=False methods to explore the pandas method, fillna() that fills in missing values of a dataframe. 
    
    
    method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
    Method to use for filling holes in reindexed Series
    pad / ffill: propagate last valid observation forward to next valid
    backfill / bfill: use next valid observation to fill gap.

In [30]:
ufo.fillna(method='bfill').tail()

                 Colors Reported Shape Reported State
Time
12/31/2000 23:00             RED       TRIANGLE    IL
12/31/2000 23:00             RED           DISK    IA
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             NaN           OVAL    FL

In [32]:
ufo.fillna(method='ffill').tail()

                 Colors Reported Shape Reported State
Time
12/31/2000 23:00             RED       TRIANGLE    IL
12/31/2000 23:00             RED           DISK    IA
12/31/2000 23:45             RED           DISK    WI
12/31/2000 23:45             RED          LIGHT    WI
12/31/2000 23:59             RED           OVAL    FL


‚òùüèª In these two methods, the inplace was set to false so it didn't affect the unerlying dataframe. 

Both methods are suitable to explore date and time Series.


üôèüèª Thank you !

üëãüèª See you in the next one !